src/resources/CegidApi/WorkerProcessService.svc.xml

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="WorkerProcessService" targetNamespace="http://www.cegid.fr/Retail/1.0" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://www.cegid.fr/Retail/1.0" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://www.cegid.fr/Retail/1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:element name="HelloWorld"><xs:annotation><xs:documentation>HelloWorld method to validate the access to Web Services from every very light HTTP client via Javascript for example</xs:documentation></xs:annotation><xs:complexType><xs:sequence><xs:element minOccurs="0" name="text" nillable="true" type="xs:string"><xs:annotation><xs:documentation>Text to pass to test consumption.</xs:documentation></xs:annotation></xs:element><xs:element minOccurs="0" name="clientContext" nillable="true" type="tns:RetailContext"/></xs:sequence></xs:complexType></xs:element><xs:complexType name="RetailContext"><xs:annotation><xs:documentation>Application context.</xs:documentation></xs:annotation><xs:sequence><xs:element minOccurs="0" name="DatabaseId" nillable="true" type="xs:string"><xs:annotation><xs:documentation>Identifier of the database to use in this execution context.</xs:documentation></xs:annotation></xs:element></xs:sequence></xs:complexType><xs:element name="RetailContext" nillable="true" type="tns:RetailContext"/><xs:element name="HelloWorldResponse"><xs:annotation><xs:documentation>HelloWorld method to validate the access to Web Services from every very light HTTP client via Javascript for example</xs:documentation></xs:annotation><xs:complexType><xs:sequence><xs:element minOccurs="0" name="HelloWorldResult" nillable="true" type="xs:string"><xs:annotation><xs:documentation>Returns the text typed upon entry, concatenated with phrase 'Hello You'</xs:documentation></xs:annotation></xs:element></xs:sequence></xs:complexType></xs:element><xs:element name="Ping"><xs:annotation><xs:documentation>[Added 2013/07 - V1104] - Pings an active CBRWorkerProcess instance and checks that it works.</xs:documentation></xs:annotation><xs:complexType><xs:sequence><xs:element minOccurs="0" name="input" nillable="true" type="xs:string"><xs:annotation><xs:documentation>Test string.</xs:documentation></xs:annotation></xs:element><xs:element minOccurs="0" name="clientContext" nillable="true" type="tns:RetailContext"/></xs:sequence></xs:complexType></xs:element><xs:element name="PingResponse"><xs:annotation><xs:documentation>[Added 2013/07 - V1104] - Pings an active CBRWorkerProcess instance and checks that it works.</xs:documentation></xs:annotation><xs:complexType><xs:sequence><xs:element minOccurs="0" name="PingResult" nillable="true" type="tns:PingReply"/></xs:sequence></xs:complexType></xs:element><xs:complexType name="PingReply"><xs:annotation><xs:documentation>Elements returned by the Ping operation.</xs:documentation></xs:annotation><xs:sequence><xs:element minOccurs="0" name="Date" type="xs:dateTime"><xs:annotation><xs:documentation>System date returned by CbrWorkerProcess.</xs:documentation></xs:annotation></xs:element><xs:element minOccurs="0" name="ElapsedMilliseconds" type="xs:long"><xs:annotation><xs:documentation>Operation time expressed in milliseconds.</xs:documentation></xs:annotation></xs:element><xs:element minOccurs="0" name="Text" nillable="true" type="xs:string"><xs:annotation><xs:documentation>Character string returned. Must be identical to the value passed as parameter during the call.</xs:documentation></xs:annotation></xs:element><xs:element minOccurs="0" name="WorkerProcessVersion" nillable="true" type="xs:string"><xs:annotation><xs:documentation>WorkerProcess version.</xs:documentation></xs:annotation></xs:element></xs:sequence></xs:complexType><xs:element name="PingReply" nillable="true" type="tns:PingReply"/></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://www.cegid.fr/fault" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://www.cegid.fr/fault" xmlns:ser="http://schemas.microsoft.com/2003/10/Serialization/"><xs:import namespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><xs:import namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xs:complexType name="CbpFaultDetail"><xs:sequence><xs:element minOccurs="0" name="Cause" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Description" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Id" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Message" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="SourceLocation" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ToDo" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="CbpFaultDetail" nillable="true" type="tns:CbpFaultDetail"/><xs:complexType name="BusinessFaultDetail"><xs:complexContent mixed="false"><xs:extension base="tns:CbpFaultDetail"><xs:sequence><xs:element minOccurs="0" name="MemberNames" nillable="true" type="q1:ArrayOfstring" xmlns:q1="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/></xs:sequence></xs:extension></xs:complexContent></xs:complexType><xs:element name="BusinessFaultDetail" nillable="true" type="tns:BusinessFaultDetail"/><xs:complexType name="ExceptionDetail"><xs:sequence><xs:element minOccurs="0" name="HelpLink" nillable="true" type="xs:string"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="InnerException" nillable="true" type="tns:ExceptionDetail"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="Message" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="StackTrace" nillable="true" type="xs:string"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="TrackingId" nillable="true" type="ser:guid"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="Type" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="ExceptionDetail" nillable="true" type="tns:ExceptionDetail"/><xs:complexType name="CbpExceptionDetail"><xs:complexContent mixed="false"><xs:extension base="tns:ExceptionDetail"><xs:sequence><xs:element minOccurs="0" name="Id" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ToDo" nillable="true" type="xs:string"/></xs:sequence></xs:extension></xs:complexContent></xs:complexType><xs:element name="CbpExceptionDetail" nillable="true" type="tns:CbpExceptionDetail"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><xs:complexType name="ArrayOfstring"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="string" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="ArrayOfstring" nillable="true" type="tns:ArrayOfstring"/></xs:schema></wsdl:types><wsdl:message name="IWorkerProcessService_HelloWorld_InputMessage"><wsdl:part name="parameters" element="tns:HelloWorld"/></wsdl:message><wsdl:message name="IWorkerProcessService_HelloWorld_OutputMessage"><wsdl:part name="parameters" element="tns:HelloWorldResponse"/></wsdl:message><wsdl:message name="IWorkerProcessService_HelloWorld_CbpFaultDetailFault_FaultMessage"><wsdl:part name="detail" element="q1:CbpFaultDetail" xmlns:q1="http://www.cegid.fr/fault"/></wsdl:message><wsdl:message name="IWorkerProcessService_HelloWorld_BusinessFaultDetailFault_FaultMessage"><wsdl:part name="detail" element="q2:BusinessFaultDetail" xmlns:q2="http://www.cegid.fr/fault"/></wsdl:message><wsdl:message name="IWorkerProcessService_HelloWorld_ExceptionDetail_FaultMessage"><wsdl:part name="detail" element="q3:ExceptionDetail" xmlns:q3="http://www.cegid.fr/fault"/></wsdl:message><wsdl:message name="IWorkerProcessService_HelloWorld_CbpExceptionDetail_FaultMessage"><wsdl:part name="detail" element="q4:CbpExceptionDetail" xmlns:q4="http://www.cegid.fr/fault"/></wsdl:message><wsdl:message name="IWorkerProcessService_Ping_InputMessage"><wsdl:part name="parameters" element="tns:Ping"/></wsdl:message><wsdl:message name="IWorkerProcessService_Ping_OutputMessage"><wsdl:part name="parameters" element="tns:PingResponse"/></wsdl:message><wsdl:message name="IWorkerProcessService_Ping_CbpFaultDetailFault_FaultMessage"><wsdl:part name="detail" element="q5:CbpFaultDetail" xmlns:q5="http://www.cegid.fr/fault"/></wsdl:message><wsdl:message name="IWorkerProcessService_Ping_BusinessFaultDetailFault_FaultMessage"><wsdl:part name="detail" element="q6:BusinessFaultDetail" xmlns:q6="http://www.cegid.fr/fault"/></wsdl:message><wsdl:message name="IWorkerProcessService_Ping_ExceptionDetail_FaultMessage"><wsdl:part name="detail" element="q7:ExceptionDetail" xmlns:q7="http://www.cegid.fr/fault"/></wsdl:message><wsdl:message name="IWorkerProcessService_Ping_CbpExceptionDetail_FaultMessage"><wsdl:part name="detail" element="q8:CbpExceptionDetail" xmlns:q8="http://www.cegid.fr/fault"/></wsdl:message><wsdl:portType name="IWorkerProcessService"><wsdl:operation name="HelloWorld"><wsdl:input wsaw:Action="http://www.cegid.fr/Retail/1.0/ICbrBasicWebServiceInterface/HelloWorld" message="tns:IWorkerProcessService_HelloWorld_InputMessage"/><wsdl:output wsaw:Action="http://www.cegid.fr/Retail/1.0/ICbrBasicWebServiceInterface/HelloWorldResponse" message="tns:IWorkerProcessService_HelloWorld_OutputMessage"/><wsdl:fault wsaw:Action="http://www.cegid.fr/Retail/1.0/ICbrBasicWebServiceInterface/HelloWorldCbpFaultDetailFault" name="CbpFaultDetailFault" message="tns:IWorkerProcessService_HelloWorld_CbpFaultDetailFault_FaultMessage"/><wsdl:fault wsaw:Action="http://www.cegid.fr/Retail/1.0/ICbrBasicWebServiceInterface/HelloWorldBusinessFaultDetailFault" name="BusinessFaultDetailFault" message="tns:IWorkerProcessService_HelloWorld_BusinessFaultDetailFault_FaultMessage"/><wsdl:fault wsaw:Action="http://www.cegid.fr/Retail/1.0/ICbrBasicWebServiceInterface/HelloWorldExceptionDetailFault" name="ExceptionDetail" message="tns:IWorkerProcessService_HelloWorld_ExceptionDetail_FaultMessage"/><wsdl:fault wsaw:Action="http://www.cegid.fr/Retail/1.0/ICbrBasicWebServiceInterface/HelloWorldCbpExceptionDetailFault" name="CbpExceptionDetail" message="tns:IWorkerProcessService_HelloWorld_CbpExceptionDetail_FaultMessage"/></wsdl:operation><wsdl:operation name="Ping"><wsdl:input wsaw:Action="http://www.cegid.fr/Retail/1.0/IWorkerProcessService/Ping" message="tns:IWorkerProcessService_Ping_InputMessage"/><wsdl:output wsaw:Action="http://www.cegid.fr/Retail/1.0/IWorkerProcessService/PingResponse" message="tns:IWorkerProcessService_Ping_OutputMessage"/><wsdl:fault wsaw:Action="http://www.cegid.fr/Retail/1.0/IWorkerProcessService/PingCbpFaultDetailFault" name="CbpFaultDetailFault" message="tns:IWorkerProcessService_Ping_CbpFaultDetailFault_FaultMessage"/><wsdl:fault wsaw:Action="http://www.cegid.fr/Retail/1.0/IWorkerProcessService/PingBusinessFaultDetailFault" name="BusinessFaultDetailFault" message="tns:IWorkerProcessService_Ping_BusinessFaultDetailFault_FaultMessage"/><wsdl:fault wsaw:Action="http://www.cegid.fr/Retail/1.0/IWorkerProcessService/PingExceptionDetailFault" name="ExceptionDetail" message="tns:IWorkerProcessService_Ping_ExceptionDetail_FaultMessage"/><wsdl:fault wsaw:Action="http://www.cegid.fr/Retail/1.0/IWorkerProcessService/PingCbpExceptionDetailFault" name="CbpExceptionDetail" message="tns:IWorkerProcessService_Ping_CbpExceptionDetail_FaultMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IWorkerProcessService" type="tns:IWorkerProcessService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="HelloWorld"><wsdl:documentation>HelloWorld method to validate the access to Web Services from every very light HTTP client via Javascript for example</wsdl:documentation><soap:operation soapAction="http://www.cegid.fr/Retail/1.0/ICbrBasicWebServiceInterface/HelloWorld" style="document"/><wsdl:input><wsdl:documentation>Text to pass to test consumption.</wsdl:documentation><soap:body use="literal"/></wsdl:input><wsdl:output><wsdl:documentation>Returns the text typed upon entry, concatenated with phrase 'Hello You'</wsdl:documentation><soap:body use="literal"/></wsdl:output><wsdl:fault name="CbpFaultDetailFault"><soap:fault use="literal" name="CbpFaultDetailFault" namespace=""/></wsdl:fault><wsdl:fault name="BusinessFaultDetailFault"><soap:fault use="literal" name="BusinessFaultDetailFault" namespace=""/></wsdl:fault><wsdl:fault name="ExceptionDetail"><soap:fault use="literal" name="ExceptionDetail" namespace=""/></wsdl:fault><wsdl:fault name="CbpExceptionDetail"><soap:fault use="literal" name="CbpExceptionDetail" namespace=""/></wsdl:fault></wsdl:operation><wsdl:operation name="Ping"><wsdl:documentation>[Added 2013/07 - V1104] - Pings an active CBRWorkerProcess instance and checks that it works.</wsdl:documentation><soap:operation soapAction="http://www.cegid.fr/Retail/1.0/IWorkerProcessService/Ping" style="document"/><wsdl:input><wsdl:documentation>Test string.</wsdl:documentation><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output><wsdl:fault name="CbpFaultDetailFault"><soap:fault use="literal" name="CbpFaultDetailFault" namespace=""/></wsdl:fault><wsdl:fault name="BusinessFaultDetailFault"><soap:fault use="literal" name="BusinessFaultDetailFault" namespace=""/></wsdl:fault><wsdl:fault name="ExceptionDetail"><soap:fault use="literal" name="ExceptionDetail" namespace=""/></wsdl:fault><wsdl:fault name="CbpExceptionDetail"><soap:fault use="literal" name="CbpExceptionDetail" namespace=""/></wsdl:fault></wsdl:operation></wsdl:binding><wsdl:service name="WorkerProcessService"><wsdl:documentation>[Added 2013/07 - V1104] - Contract of the technical Web Service linked with CBRWorkerProcess</wsdl:documentation><wsdl:port name="BasicHttpBinding_IWorkerProcessService" binding="tns:BasicHttpBinding_IWorkerProcessService"><soap:address location="http://10.0.2.58/Y2_LAB/WorkerProcessService.svc"/></wsdl:port></wsdl:service></wsdl:definitions>